/**
 * @file
 * @brief Файл с дополнительными функциями
*/

#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <assert.h>

#include <string.h>
#include <ctype.h>
#include <sys/stat.h>
#include <unistd.h>
#include <time.h>

#include "../H/config.h"
// #include "const.h"
#include "../H/type.h"
#include "../H/func.h"



// --------------------------------------------------------------------------------------------------
/**
 * @brief Хеш-функция
 * @param [in] string Строка, которая преобразуется в хеш
 * @return Хеш строки
*/
// --------------------------------------------------------------------------------------------------
int get_hash (const char* string)
{
    assert (string);

    int index = 0;
    int hash = 5381;
    while (string[index] != '\0')
    {
        hash = int ((size_t) hash * 33 + (size_t) string[index]);
        index++;
    }

    return hash;
}
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция, превращающая число в строку его десятичной записи
 * @param [in] value Число, которое надо превратить
 * @return Указатель на динамическую память, где храниться строка
*/
// --------------------------------------------------------------------------------------------------
char* int_to_char (int value)
{
    int i = 1;
    unsigned int len = 1;

    while (value % i != 0)
    {
        i *= 10;
        len++;
    }

    char* buffer = (char*) calloc (len + 1, sizeof (char));
    if (buffer == NULL)
    {
        EXIT_FUNC("NULL calloc", NULL);
    }

    unsigned int count = 0;
    for (i = 1; count < len; i *= 10, count++)
    {
        buffer[count] = char ('0' + (value % (i * 10)) / i);
    }

    buffer[len] = '\0';

    return buffer;
}
// --------------------------------------------------------------------------------------------------


// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция, находящая размер файла в байтах по его имени
 * @param [in] name_file Имя файла
 * @return Размер файла
*/
// -------------------------------------------------------------------------------------------------------
size_t file_size_check (const char* name_file)
{
    assert(name_file);

    struct stat file_stat = {};

    if (stat (name_file, &file_stat) == -1)
    {
        printf ("ERROR with stat\n");
        return 0;
    }
//     Вроде как размер не должен быть отрицательным
    return (size_t) file_stat.st_size;
}
// -------------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция нахождения размера имени объекта
 * @param [in] object Объект, размер имени которого нужен
*/
// --------------------------------------------------------------------------------------------------
size_t get_len_name (obj_t object)
{
    ASSERT_OBJECT(object);

    size_t counter = 0;
    while (1)
    {
        if (object.name[counter] == '\0')
        {
            return counter;
        }
        counter++;
    }
    return 0;
}
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция нахождения нужной директории для дампов этого запуска
 * @return Номер директории в стандартной папку дампов
*/
// --------------------------------------------------------------------------------------------------
int find_number_dump ()
{
    return STANDARD_DIR_DUMP;
}
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания адреса файла в папке
 * @param [in] address_dir Адрес стандартной директории, в которой находится файл
 * @param [in] number_dir Номер нужной директории в стандартной
 * @param [in] address_file Адрес файла в нужной директории
 * @param [in] string Строка, куда будет записан адрес
*/
// --------------------------------------------------------------------------------------------------
int make_dir_address (const char* address_dir,
                      const int number_dir,
                      const char* address_file,
                      char* string)
{
    assert (address_dir);
    assert (string);

    sprintf (string, "%s%d/%s", address_dir, number_dir, address_file);
    return 0;
}
// --------------------------------------------------------------------------------------------------


// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция очистки и начального заполнения html файла
 * @param [in] address_html Адрес html файла
*/
// -------------------------------------------------------------------------------------------------------
int clean_html (const char* address_html)
{
    assert (address_html);

    if (access (address_html, F_OK) != 0)
    {
        printf ("File does not exist\n");
        return -1;
    }

    FILE* file = fopen (address_html, "w");
    if (file == NULL)
    {
        EXIT_FUNC ("NULL file\n", -1);
    }

    fprintf (file,
             "<pre style=\"font-family: 'Courier New', monospace;"
             "font-size: 14px; color: #e0e0e0; background-color: #1e1e1e; padding: 10px; border-radius: 6px;\">\n\n");
    fclose (file);
    return 0;

}
// -------------------------------------------------------------------------------------------------------


// -------------------------------------------------------------------------------------------------------
/**
 * @brief Функция очистки выбранной директории
 * @param [in] address_dir Адрес выбранной директории
*/
// -------------------------------------------------------------------------------------------------------
int clean_dir (const char* address_dir)
{
    assert (address_dir);

    char comand[200] = "";
    sprintf (comand, "rm -rf ./%s/*", address_dir);
    int trash = system (comand);
    (void) trash;

    return 1;
}
// -------------------------------------------------------------------------------------------------------







