/**
 * @file
 * @brief Конфигурация для основным функций дерева
*/

#ifndef CONFIG_H
#define CONFIG_H

#include <SDL2/SDL.h>
#include <SDL2/SDL_ttf.h>
#include <SDL2/SDL_image.h>


// ----------------------------------------------------------------------------------------------------
/// @brief Включения функций, работающих на стеке и отключение рекурсии
#define STACK_FUNC
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Адреса данных для дампов и деревьев
*/
// ----------------------------------------------------------------------------------------------------
const char ADDRESS_DUMP_DIR[] = "DUMPS/DUMP_";
const char ADDRESS_DATA_DIR[] = "DATA/DATA_";
const char ADDRESS_USER_DATA[] = "USER_DATA";
// ----------------------------------------------------------------------------------------------------
#define ADDRESS_DUMP_DEBUG "DUMPS/DEBUG/"
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/** @brief Номер стандартной директории для дампов
 * В директорию под этим номером будут отправляться все дампы
 * @see find_number_dump ()
*/
// ----------------------------------------------------------------------------------------------------
const int STANDARD_DIR_DUMP = 1;
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/// @brief Количество директорий, куда может сохраняться дамп
const int AMOUNT_DATA_DIR = 4;
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/// @brief Стандартный размер одного блока дерева на картинке в html файле
const int STANDARD_SIZE_BLOCK = 250;
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/// @brief Задержка программы при обновлении экрана
const int STANDARD_SLEEP = 50;
// ----------------------------------------------------------------------------------------------------

/// @brief Пути к изображениям и аудио объектов для их записи и показа
// ----------------------------------------------------------------------------------------------------
const char OBJECT_IMAGE[] = "GRAPHIC/OBJECT/IMAGES/";
const char OBJECT_AUDIO[] = "GRAPHIC/OBJECT/AUDIO/";
// ----------------------------------------------------------------------------------------------------



#endif // CONFIG_H
