/**
 * @file
 * @brief Константы для функций дерева
*/

#ifndef CONST_H
#define CONST_H


// --------------------------------------------------------------------------------------------------
/// @brief Объект, добавляющийся в дерево в самом начале (NULL element)
char START_OBJECT_NAME[] = "Unknown who";
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Синтаксис, который будет пропускаться при чтении дерева из файла
const char SYNTAX_VOID[] =
{
    ' ',
    '\n',
    '\r',
    '\0',
    ',',
    '.'
};
// --------------------------------------------------------------------------------------------------



#endif // CONST_H
