#ifndef DISPLAY_H
#define DISPLAY_H

#include "type.h"

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания дисплея
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int create_display (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания общего графического интерфейса
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int create_system_UI (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция загрузки изображения в текстуру
 * @param [in] render Указатель на окно рендера
 * @param [in] filename Имя загружаемого изображения
 * @return Указатель на текстуру
*/
// --------------------------------------------------------------------------------------------------
SDL_Texture* load_texture (SDL_Renderer* render,
                           const char* filename);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки текстуры в окне
 * @param [in] render Указатель на окно рендера
 * @param [in] texture Указатель на структуру которую нужно отрисовать
 * @param [in] rect Место и размеры для отрисовки
*/
// --------------------------------------------------------------------------------------------------
int draw_texture (SDL_Renderer* render,
                  SDL_Texture* texture,
                  SDL_Rect* rect);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки кадра видео
 * @param [in] render Указатель на окно рендера
 * @param [in] video Указатель на структуру видео
*/
// --------------------------------------------------------------------------------------------------
int play_video (SDL_Renderer* render,
                _video_t* video);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция удаления структуры дисплея
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int destroy_display (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция удаления видео
 * @param [in] video Указатель на структуру видео
*/
// --------------------------------------------------------------------------------------------------
int free_video (_video_t* video);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания текстуры кнопки
 * @param [in] button Указатель на структуру кнопки, куда будет записана текстура
 * @param [in] render Указатель на окно для рендера
 * @param [in] text Текст кнопки
 * @param [in] font Шрифт кнопки
 * @param [in] color Цвет фона кнопки
*/
// --------------------------------------------------------------------------------------------------
int create_button (button_t* button,
                   SDL_Renderer* render,
                   const char* text,
                   TTF_Font* font,
                   SDL_Color color);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция загрузки текста в основное окна
 * @param [in] display Указатель на структуру дисплея
 * @param [in] format Формат строки, которую нужно добавить
 * @note Читает только %s и %d
 * @note Удаляет предыдущий текст
*/
// --------------------------------------------------------------------------------------------------
int push_text (display_t* display,
              const char* format, ...);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция, записывающая текст в основное окно
 * @param [in] display Указатель на структуру дисплея
 * @param [in] format Формат строки, которую нужно добавить
 * @param [in] args Аргументы для строки
*/
// --------------------------------------------------------------------------------------------------
int push_text__va_list (display_t* display,
                        const char* format,
                        va_list args);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция добавления текста в основное окно
 * @param [in] display Указатель на дисплей
 * @param [in] format Формат строки, которую нужно добавить
 * @note Читает только %s и %d
*/
// --------------------------------------------------------------------------------------------------
int add_text (display_t* display,
              const char* format, ...);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция обновления экрана
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int renew_display (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция вывода текущего текста основного окна
 * @param [in]  display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_main_text (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция обновления кнопок
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_buttons (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки пользовательского текста
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_user_text (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки всех анимаций
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_video (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки изображения в поле для пользовательских изображений
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_object (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция получения следующей задачи от пользователя
 * @param [in] prev Предыдущая задача
*/
// --------------------------------------------------------------------------------------------------
EVENT get_event (EVENT prev,
                 display_t* display);
// --------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция получения ответа типа 'да/нет' от пользователя
 * @param [in] true_c Левая кнопка
 * @param [in] false_c Правая кнопка
 * @return USER_YES (если да), иначе -> USER_NO
 * @note Сама обновляет дисплей
*/
// ----------------------------------------------------------------------------------------------------
int get_user_bool (display_t* display,
                   const char* true_c,
                   const char* false_c);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция остановки программы по клика пользователем (кнопка CONTINUE)
 * @param [in] display Указатель на структуру дисплея
*/
// ----------------------------------------------------------------------------------------------------
int get_user_continue (display_t* display);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция считывания пользовательского текста
 * @param [in] display Указатель на структуру дисплея
 * @param [in] string Указатель на адрес, куда будет записан пользовательский текст
*/
// ----------------------------------------------------------------------------------------------------
int get_user_text (display_t* display,
                   char** string);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция проверки нажатия кнопки
 * @param [in] button Указатель на структуру проверяемой кнопки
 * @param [in] event Текущий ивент
 * @return 1 (если была нажата), иначе 0
*/
// ----------------------------------------------------------------------------------------------------
int check_button_click (button_t* button,
                        SDL_Event* event);
// ----------------------------------------------------------------------------------------------------










#endif // DISPLAY_H
