#ifndef DISPLAY_H
#define DISPLAY_H

#include "type.h"

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания дисплея
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int create_display (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания общего графического интерфейса
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int create_system_UI (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания видео-анимаций
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int create_anim (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция инициализации аудио-устройств
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int create_audio (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция загрузки изображения в текстуру
 * @param [in] render Указатель на окно рендера
 * @param [in] filename Имя загружаемого изображения
 * @return Указатель на текстуру
*/
// --------------------------------------------------------------------------------------------------
SDL_Texture* load_texture (SDL_Renderer* render,
                           const char* filename);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки текстуры в окне
 * @param [in] render Указатель на окно рендера
 * @param [in] texture Указатель на структуру которую нужно отрисовать
 * @param [in] rect Место и размеры для отрисовки
*/
// --------------------------------------------------------------------------------------------------
int draw_texture (SDL_Renderer* render,
                  SDL_Texture* texture,
                  const SDL_Rect* rect);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки кадра видео
 * @param [in] render Указатель на окно рендера
 * @param [in] video Указатель на структуру видео
*/
// --------------------------------------------------------------------------------------------------
int play_video (SDL_Renderer* render,
                _video_t* video);
// --------------------------------------------------------------------------------------------------


// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция получения имени изображения и записи голоса
 * @param [in] display Указатель на структуру дисплея
 * @param [in] object Указатель на объект, к которому будет добавляться информация
*/
// ----------------------------------------------------------------------------------------------------
int get_image_audio (display_t *display,
                     obj_t* object);
// ----------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция проигрывания wav файла
 * @param [in] play_device Устройство, на котором будет проигрываться файл
 * @param [in] name_wav Имя файла
*/
// --------------------------------------------------------------------------------------------------
int play_audio (SDL_AudioDeviceID play_device,
                const char* name_wav);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция записи аудио в файл
 * @param [in] display Указатель на структуру дисплея
 * @param [in] button Кнопка, нажатие на которую останавливает запись
 * @param [in] record_device Устройство для записи
 * @param [in] file Имя файла, куда будет записываться аудио
*/
// --------------------------------------------------------------------------------------------------
int record_audio (display_t* display,
                  button_t* button,
                  SDL_AudioDeviceID record_device,
                  const char* file);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция записи аудио-семплов в wav файл
 * @param [in] param Параметры аудио для записи
 * @param [in] file_name Имя файла
 * @param [in] data Аудио данные
 * @param [in] len_data Длина data
*/
// --------------------------------------------------------------------------------------------------
int save_audio (const SDL_AudioSpec* param,
                const char* file_name,
                const uint8_t* data,
                uint32_t len_data);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция получения количества байт в секунду для заполнения заголовка wav файла
 * @param [in] format Формат аудио
 * @return Количество байт в секунду
*/
// --------------------------------------------------------------------------------------------------
int sdl_format_to_bits (SDL_AudioFormat format);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция удаления структуры дисплея
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int destroy_display (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция удаления видео
 * @param [in] video Указатель на структуру видео
*/
// --------------------------------------------------------------------------------------------------
int free_video (_video_t* video);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция очистки кнопок
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int clean_buttons (display_t* display);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция создания текстуры кнопки
 * @param [in] button Указатель на структуру кнопки, куда будет записана текстура
 * @param [in] render Указатель на окно для рендера
 * @param [in] text Текст кнопки
 * @param [in] font Шрифт кнопки
 * @param [in] color Цвет фона кнопки
*/
// --------------------------------------------------------------------------------------------------
int create_button (button_t* button,
                   SDL_Renderer* render,
                   const char* text,
                   TTF_Font* font,
                   SDL_Color color);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция загрузки текста в основное окна
 * @param [in] display Указатель на структуру дисплея
 * @param [in] format Формат строки, которую нужно добавить
 * @note Читает только %s и %d
 * @note Удаляет предыдущий текст
*/
// --------------------------------------------------------------------------------------------------
int push_text (display_t* display,
              const char* format, ...);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция, записывающая текст в основное окно
 * @param [in] display Указатель на структуру дисплея
 * @param [in] format Формат строки, которую нужно добавить
 * @param [in] args Аргументы для строки
*/
// --------------------------------------------------------------------------------------------------
int push_text__va_list (display_t* display,
                        const char* format,
                        va_list args);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция добавления текста в основное окно
 * @param [in] display Указатель на дисплей
 * @param [in] format Формат строки, которую нужно добавить
 * @note Читает только %s и %d
*/
// --------------------------------------------------------------------------------------------------
int add_text (display_t* display,
              const char* format, ...);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция изменения текущей анимации
 * @param [in] display Указатель на структуру дисплея
 * @param [in] type Тип анимации
*/
// --------------------------------------------------------------------------------------------------
int add_anim (display_t* display,
              __ANIM_TYPE type);
// --------------------------------------------------------------------------------------------------


// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция обновления экрана
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int renew_display (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция вывода текущего текста основного окна
 * @param [in]  display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_main_text (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция обновления кнопок
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_buttons (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки пользовательского текста
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_user_text (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки всех анимаций
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_video (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция отрисовки изображения в поле для пользовательских изображений
 * @param [in] display Указатель на структуру дисплея
*/
// --------------------------------------------------------------------------------------------------
int render_object (display_t* display);
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/**
 * @brief Функция получения следующей задачи от пользователя
 * @param [in] prev Предыдущая задача
*/
// --------------------------------------------------------------------------------------------------
EVENT get_event (EVENT prev,
                 display_t* display);
// --------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция получения ответа типа 'да/нет' от пользователя
 * @param [in] true_c Левая кнопка
 * @param [in] false_c Правая кнопка
 * @return USER_YES (если да), иначе -> USER_NO
 * @note Сама обновляет дисплей
*/
// ----------------------------------------------------------------------------------------------------
int get_user_bool (display_t* display,
                   const char* true_c,
                   const char* false_c);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция остановки программы по клика пользователем (кнопка CONTINUE)
 * @param [in] display Указатель на структуру дисплея
*/
// ----------------------------------------------------------------------------------------------------
int get_user_continue (display_t* display);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция считывания пользовательского текста
 * @param [in] display Указатель на структуру дисплея
 * @param [in] string Указатель на адрес, куда будет записан пользовательский текст
*/
// ----------------------------------------------------------------------------------------------------
int get_user_text (display_t* display,
                   char** string);
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
/**
 * @brief Функция проверки нажатия кнопки
 * @param [in] button Указатель на структуру проверяемой кнопки
 * @param [in] event Текущий ивент
 * @return 1 (если была нажата), иначе 0
*/
// ----------------------------------------------------------------------------------------------------
int check_button_click (button_t* button,
                        SDL_Event* event);
// ----------------------------------------------------------------------------------------------------










#endif // DISPLAY_H
