#ifndef DISPLAY_CONFIG_H
#define DISPLAY_CONFIG_H

#include <SDL2/SDL.h>
#include <SDL2/SDL_ttf.h>
#include <SDL2/SDL_image.h>

// extern button_desc_t;

// ----------------------------------------------------------------------------------------------------
// Параметры графики
// ----------------------------------------------------------------------------------------------------
const int SCREEN_WIDTH = 1600;
const int SCREEN_HEIGHT = 900;
const int INDENT = 5;
// ----------------------------------------------------------------------------------------------------
const int BUTTON_WIDTH = 345;
const int BUTTON_HEIGHT = 45;
// ----------------------------------------------------------------------------------------------------
const int AMOUNT_BUTTONS = 6;
// ----------------------------------------------------------------------------------------------------
const SDL_Color COLOR_FONT = {255, 255, 255, 255};
// ----------------------------------------------------------------------------------------------------
const char DISPLAY_FONT[] = "GRAPHIC/SYSTEM/font.ttf";
const char BACKGROUND[] = "GRAPHIC/SYSTEM/BACK/";
const char SIDE_VIDEO[] = "GRAPHIC/SYSTEM/SIDE/";
// ----------------------------------------------------------------------------------------------------
const int LEN_VIDEO_BACKGROUND = 1;
const int LEN_VIDEO_SIDE = 0; // 25
// ----------------------------------------------------------------------------------------------------
const int SIZE_LINE = 2;
// ----------------------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------------------
const int CENTER_MAIN_TEXT_X = SCREEN_WIDTH / 2;
const int CENTER_MAIN_TEXT_Y = 150 / 2;
const int CENTER_USER_TEXT_X = SCREEN_WIDTH / 2;
const int CENTER_USER_TEXT_Y = 800;
// ----------------------------------------------------------------------------------------------------
const int MAX_USER_LEN_TEXT = 60;
const Uint64 TIME_DELAY_CURSOR = 500;
// ----------------------------------------------------------------------------------------------------



#endif // DISPLAY_CONFIG_H
