/**
 * @file
 * @brief Типы объектов
*/

#ifndef TYPE_H
#define TYPE_H

#include <SDL2/SDL.h>
#include <SDL2/SDL_ttf.h>
#include <SDL2/SDL_image.h>
#include <SDL2/SDL_mixer.h>

#include "config.h"
#include "display-config.h"


// ---------------------------------------------------------------------------------------------------
/**
 * @brief Типы расположения кнопок на экране
 * @see MAIN_MENU_BUT[]
*/
// ---------------------------------------------------------------------------------------------------
enum PLACE_BUTTON
{
    LEFT_DOWN   = 0,
    RIGHT_DOWN  = 1,
    LEFT_MID    = 2,
    RIGHT_MID   = 3,
    LEFT_UP     = 4,
    RIGHT_UP    = 5,
    CENTER_UP   = 6
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Тип текущей анимации
enum __ANIM_TYPE
{
    STANDARD_ANIM       = 10, // Отсутствие анимации
    TYPING_ANIM         = 0,
    PLAY_AUDIO_ANIM     = 1,
    RECORD_AUDIO_ANIM   = 2
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Тип текущего системного звука
enum __AUDIO_SYSTEM_TYPE
{
    WITHOUT_SYSTEM_MUSIC    = 0,
    FONE_SYSTEM_MUSIC       = 1
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Стороны, с которых можно добавлять элементы в дерева
enum SIDES
{
    LEFT_SIDE   = 0,
    RIGHT_SIDE  = 1
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Да/Нет, полученные от пользователя
enum BOOL
{
    USER_YES = 0,
    USER_NO  = 1
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Все возможные ивенты
enum EVENT
{
    NULL_EVENT          = 0,
    START_PROGRAM       = 1,
    GUESS_OBJECT        = 2,
    COMPARE_OBJECTS     = 3,
    DESC_OBJECT         = 4,
    SAVE_DATA           = 5,
    IMPORT_DATA         = 6,
    EXIT_PROGRAM        = 7
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Показатели объектов
enum TYPE_OBJECT
{
    NO_OWN_MEMORY   = 0x0000,
    OWN_MEMORY      = 0x0001,
    IS_IMAGE        = 0x0002,
    IS_AUDIO        = 0x0004
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура кнопки для экрана
struct button_t
{
    SDL_Texture* but;
    PLACE_BUTTON type;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура параметров кнопки
struct button_desc_t
{
    const char* name;
    PLACE_BUTTON place;
    EVENT event;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура видео для его воспроизведения
struct _video_t
{
    SDL_Texture** frames;
    int amount;
    int current;
    const SDL_Rect* place;

    int delay;
    int time_left;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура аудио-устройств и их параметров
struct _audio_t
{
    SDL_AudioDeviceID record;
    SDL_AudioSpec param_record;
    SDL_AudioDeviceID play;
    SDL_AudioSpec param_play;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура текущего кадра
struct _frame_t
{
    char* main_text;
    char* user_text;

    char* obj_img;
    __AUDIO_SYSTEM_TYPE type_audio;

    button_t buttons[AMOUNT_BUTTONS];
    int amount_but;
    __ANIM_TYPE anim_type;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура системного интерфейса
struct _system_interface_t
{
    _video_t background;
    _video_t main;
    _video_t user;
    _video_t* mass_anim;
    Mix_Music* fone_music;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Основная структура для работы с графикой
struct display_t
{
    SDL_Window* window;
    SDL_Renderer* render;
    TTF_Font* font;
    _system_interface_t system;
    _frame_t cur_frame;
    _audio_t audio_data;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура объекта дерева
struct object_t
{
    char* name;
    int hash;
    char* audio;
    char* image;
    int type_object;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
typedef object_t obj_t;
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура узла дерева
struct node_t
{
    node_t* father;
    node_t* left;
    node_t* right;
    obj_t object;
};
// --------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------------------
/// @brief Структура дерева
struct tree_t
{
    node_t* null;
    size_t size;
    int num_dump;
    char* buffer;
    display_t* display;
};
// --------------------------------------------------------------------------------------------------

extern const button_desc_t MAIN_MENU_BUN[];


#endif // TYPE_H
